first = 10
second = 20

print(first + second)
print(first - second)
print(first * second)
print(first / second)
print(first ** second)
print(first % second)
print(first // second)

"""
Доброго времени суток!Меня зовут Виктор ,я студент 3-го курса в Государственном Университете
интелектуальних технологий и связи(бывш.Академия связи им.Попова).На данний момент работаю в 
"Епицентр К" на должности художник-оформитель в отделе внутренней рекламы.

Я не знал с чего начать , чтобы войти в IT. Проанализировав свои интересы я выбрал разработку игр ,
нейросети и автоматизацию,а потом выбрал инструмент , который для этого вроде неплохо подходит т.е. пайтон.

"""


